tutorials/combustion/PDRFoam/flamePropagationWithObstacles/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
<<<<<<< HEAD
|  \\    /   O peration     | Version:  3.0.x                                 |
=======
|  \\    /   O peration     | Version:  4.x                                   |
>>>>>>> 90e2f8d87bcd3a8588545c2de68a62d5b5c54a99
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

laminarFlameSpeedCorrelation SCOPE;

fuel        Propane;

fuelFile    "fuels/propane.dat";

ignite      yes;

ignitionSites
(

    {
        location        (1.5 1.5 0.5);
        diameter        0.1;
        start           1E-05;
        duration        0.05;
        strength        60.0;
    }
);

ignitionSphereFraction  1;

ignitionThickness   ignitionThickness [0 1 0 0 0 0 0] 0;

ignitionCircleFraction  0;

ignitionKernelArea ignitionKernelArea [0 2 0 0 0 0 0] 0;

// ************************************************************************* //
